app/controllers/posts_controller.rb

	def create
		@post = current_user.posts.build(post_params)
		if @post.save
---
INSERT INTO "posts" ("body", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["body", "This is a new post"], ["user_id", 2], ["created_at", "2020-07-09 10:55:38.113543"], ["updated_at", "2020-07-09 10:55:38.113543"]]